<div style="max-height: 600px; overflow-y: scroll;">
    <div style="display: grid; grid-template-columns: 50% 50%;">
        <img src="/gag/gag.png" style="width: 100%;"> <!-- width="300px"> -->
        <div style="padding: 14px;">
            <h2>Gare aux Godilles !</h2>
            <p>
                Apprenez &agrave; godiller, c'est une technique ancestrale, qui a fait ses preuves, et
                qu'il ne faut pas laisser se perdre, il faut la transmettre&nbsp;!<br/>
                Non polluant, efficace, pas d'&eacute;mission de gaz &agrave; effet de serre, silencieux, &eacute;l&eacute;gant... Tout 
                le contraire d'un moteur hors-bord&nbsp;!
            </p>
        </div>
    </div>
    <div style="line-height: 1.2em;">
        Ce projet est en cours de d&eacute;veloppement, on aura bient&ocirc;t plus de d&eacute;tails &agrave; son sujet ici.
    </div>
    <hr/>
    <div style="line-height: 1.2em;">
        La godille a &eacute;t&eacute; invent&eacute;e dans des r&eacute;gions o&ugrave; le bois n&eacute;cessaire &agrave; la fabrication des avirons ne pousse pas. 
        Il fallait importer ce bois des r&eacute;gions o&ugrave; il pousse, &ccedil;a avait une influence notoire sur le prix une paire d'avirons...<br/>
        D'o&ugrave; l'id&eacute;e toute simple (encore une) : si on peut faire avancer sa plate avec un seul aviron, &ccedil;a co&ucirc;tera deux fois moins cher&nbsp;!<br/>
        Le r&eacute;sultat est surprenant... Quand on godille, la pelle est tout le temps dans l'eau, propulsive et efficace, ce qui n'est pas le cas
        lorsqu'on nage (si ! on dit "nager" ! on ne dit pas "ramer" !), o&ugrave; les pelles sont hors de l'eau la moiti&eacute; du temps.
        La godille se trouve ainsi &ecirc;tre la plus efficace des options...<br/>
        Pour la m&ecirc;me raison, <a href="http://alternav.com" target="Alternav">Alex de Roquefeuil</a> construit des avirons de godille &agrave; partir
        de m&acirc;ts de planche &agrave; voile recycl&eacute;s. Et ses avirons sont de vraies bombes !
    </div>
    <hr/>
    <div style="width: 98%; ">
        <h2>Fin mars 2024</h2>
        On va se construire une "godillette", avec les conseils d'Alex de Roquefeuil.
        <br/>
        <img src="./images/godille/godillette.jpeg" style="width: 100%;">
    </div>
    <hr/>
</div>
