<div class="boat-card" header="De Cap en Cap">

    <div class="tab" style="margin-top: 30px; margin-bottom: 10px; display: grid; grid-template-columns: auto auto auto auto auto auto auto auto auto auto auto;"> <!-- TODO Improve the grid-template... -->
        <button class="tablinks tab-active" onclick="openTab(event, 'cap-en-cap-01');" title="Projet">Projet</button>
        <button class="tablinks" onclick="openTab(event, 'cap-en-cap-02');">D&eacute;tails</button>
        <button class="tablinks" onclick="openTab(event, 'cap-en-cap-03');">Contact</button>
        <button class="tablinks" onclick="openTab(event, 'cap-en-cap-04');">Nous soutenir</button>
    </div>

    <div class="pcc-dialog-tab-content">
        <div id="cap-en-cap-01" class="tab-section" style="display: block;">

            <!--div style="vertical-align: middle;"><img src="/images/construction.cone.png" height="26"> <b>Projets Low Tech&nbsp;!</b> <img src="/images/construction.cone.png" height="30"></div-->
            <div class="txt-img-div-2" style="margin-top: 0;">
                <!--iframe src="https://akirodic.com/p/jellyfish/" style="width: 80%; height: 100%;"></iframe-->
                <img src="/images/boats/nomadict/nomadict.00.jpg" style="width: 80%; margin: auto; margin-top: 5px;">
                <div style="padding: 14px;">
                    <div style="padding: 10px; line-height: 1.2em;">
                        "L'aventure repose sur la richesse des liens qu'elle &eacute;tablit,
                        des probl&egrave;mes qu'elle pose, des cr&eacute;ations qu'elle provoque."<br/>
                        <i>Antoine de Saint Exup&eacute;ry</i>
                    </div>
                    <div style="padding: 10px; line-height: 1.2em;">
                        "Le bateau est en s&eacute;curit&eacute; dans le port. Mais, ce n'est pas pour cela que
                        les bateaux ont &eacute;t&eacute; construits."<br/>
                        <i>Paulo Coelo</i>
                    </div>
                    <div style="padding: 10px; line-height: 1.2em;">
                        Franchir un cap, c'est mettre tout en &oelig;uvre pour acc&eacute;der &agrave; un inconnu synonyme de nouvel horizon.
                        Il en est ainsi en bateau, &eacute;videmment, et dans la vie. Affronter et d&eacute;passer une probl&eacute;matique,
                        quelle qu'elle soit, permet de grandir et de nous offrir de nouveaux horizons.
                    </div>
                </div>
            </div>
        </div>

        <div id="cap-en-cap-02" class="tab-section" style="display: none;">
            <h2>D&eacute;tails</h2>
            <div class="project-content" style="display: grid; grid-template-columns: 100%;">
                <div style="overflow: auto;">
                    <div>
                        De Cap en Cap est la rencontre de deux vieux r&ecirc;ves : le voyage en bateau, en c&ocirc;toyant des r&eacute;gions hors des s
                        illages habituels de croisi&egrave;res, du cap Nord au cap Horn, qu'il est temps de r&eacute;aliser, et l'accompagnement de personnes,
                        et particuli&egrave;rement des jeunes, rencontrant des difficult&eacute;s de toutes sortes (d&eacute;socialisation, maladie, mal &ecirc;tre…)
                        dans un univers souvent inconnu et extraordinaire (sortant de l'ordinaire), offrant la possibilit&eacute; de d&eacute;couvrir une portion
                        non v&eacute;cue d'eux-m&ecirc;mes.<br/>
                        La mer, le bateau, la navigation font peur. Ils attirent aussi. Ils impressionnent. Ils font cogiter. Ce contact avec l'infini, avec
                        l'inconnu, avec "l'autre c&ocirc;t&eacute;", avec ce que l'on ne maîtrise pas, effraie et, de ce fait, fascine. Offrir la
                        possibilit&eacute; de se d&eacute;couvrir le courage d'affronter l'inconnu me passionne autant qu'il peut lib&eacute;rer celui ou
                        celle qui vit l'exp&eacute;rience. La force des &eacute;l&eacute;ments, le contact perp&eacute;tuel avec la nature, l'exiguït&eacute;
                        du lieu de vie, la promiscuit&eacute; avec les autres &eacute;quipiers nous confronte avec notre &ecirc;tre profond. Les diff&eacute;rents
                        masques de protection que l'on s'est forg&eacute; &agrave; terre pour s'adapter au milieu de vie et ses difficult&eacute;s, tombent rapidement &agrave; bord
                        d'un voilier en navigation. La navigation permet de se retrouver soi.<br/>
                        Utiliser la mer &agrave; des fins th&eacute;rapeutiques remonte &agrave; l'Antiquit&eacute;. La navigation &agrave; cette fin est plus r&eacute;cente mais elle
                        concerne autant les troubles somatiques que psychiques. Des personnalit&eacute;s comme Marcel Rufo, Boris Cyrulnik ou Xavier Pommereau
                        ont utilis&eacute; ce m&eacute;dium pour am&eacute;liorer voire transformer nombre de leur patient. L'association Ocean Connect bas&eacute;e &agrave;
                        Toulouse est en train d'initier en collaboration avec une &eacute;quipe du CHU de Rangueil, une &eacute;tude scientifique pilote sur la recherche clinique
                        d'une hypoth&egrave;se de stabilisation voir gu&eacute;rison des maladies chroniques en mer.
                        Cette hypoth&egrave;se fait lien avec mes propres constatations lors de ma vie de marin-th&eacute;rapeute. Le fait de se sentir port&eacute;
                        et la douceur des mouvements en voilier permet un relâchement g&eacute;n&eacute;ral du corps et donc une baisse notable des ph&eacute;nom&egrave;nes
                        inflammatoires. Les exemples de r&eacute;mission de maladie en navigation sont nombreux (je pense &agrave; Dominique Guyot souffrant de scl&eacute;rose en plaque dont les sympt&ocirc;mes ont pratiquement disparu lors de son p&eacute;riple en voilier ainsi qu'&agrave; Marie Dufay, une amie journaliste qui souffre de plusieurs pathologies nerveuses et musculaires pour qui la navigation &agrave; la voile calme les douleurs).
                        Nomadict accueillerait ainsi, dans le cadre d'Ocean Connect, des personnes souffrant de maladies d'origine inflammatoire suivant un
                        protocole pr&eacute;cis afin d'observer les effets de la navigation sur l'&eacute;volution de la maladie.
                        Parall&egrave;lement, il sera propos&eacute; des s&eacute;jours th&eacute;rapeutiques &agrave; destination de personnes mal dans leur peau
                        afin de les accompagner dans la d&eacute;couverte de leurs fonctionnements, de ce qui les emp&ecirc;che &agrave; s'&eacute;panouir et surtout
                        identifier et mobiliser des ressources insoupçonn&eacute;es. Ses s&eacute;jours seront r&eacute;alis&eacute;s en direct (nous sommes th&eacute;rapeutes)
                        ou en collaboration avec des organismes d&eacute;di&eacute;s.
                    </div>
                    <div>
                        Enfin, Nomadict pourra participer &agrave; des op&eacute;rations organis&eacute;es par l'Association Grand Largue ou
                        Matelots de la vie, qui chacun dans son domaine (jeune en situation de protection administrative ou judiciaire et enfants hospitalis&eacute;s)
                    </div>
                    <div>
                        <h3>&agrave; quoi servira l'argent collect&eacute; ?</h3>
                        &agrave; la r&eacute;paration et pr&eacute;paration du bateau ainsi qu'&agrave; l'assistance logistique que
                        Passe-Coque am&egrave;ne qu'il soit &eacute;cologique, social, humanitaire, ou patrimonial mais surtout maritime.
                        Nomadict est un Gin Fizz construit en 1975. Il demande une r&eacute;fection importante. Nous envisageons, pour l'ext&eacute;rieur de lui
                        ajouter une jupe &agrave; l'arri&egrave;re, un bout dehors pour porter un spi asym&eacute;trique et un gennaker,
                        ainsi qu'une casquette rigide pour augmenter le confort dans les zones froides. A l'int&eacute;rieur, le changement des vaigrages,
                        quelques modifications d'emm&eacute;nagement, la r&eacute;fection du circuit &eacute;lectrique, le changement des appareils &eacute;lectroniques.
                        Il est pr&eacute;vu que quelques travaux de cette r&eacute;fection soient publi&eacute;s dans Voile Magazine.
                    </div>
                    <div>
                        <h3>Qui&nbsp;?</h3>
                        <b>Patrick Benoiton</b>, navigateur, journaliste, &eacute;crivain, th&eacute;rapeute, int&eacute;ress&eacute; du fonctionnement humain,
                        veut donner un nouvel &eacute;lan dans sa vie avant que ce ne soit possible. Il r&ecirc;ve depuis longtemps de partager sa passion pour la vie en
                        voilier et le d&eacute;passement du raisonnable &agrave; ceux qui n'y ont pas acc&egrave;s pour diverses raisons. Le "tout est possible" l'a
                        souvent guid&eacute; dans ces choix. Il est temps de transmettre les quelques connaissances qu'il a pu accumuler.
                        <br/>
                        <b>Fr&eacute;d&eacute;rique Benoiton</b>, infirmi&egrave;re, cadre de sant&eacute;, coach, th&eacute;rapeute, montagnarde, curieuse de
                        l'humain, veut apporter du sens &agrave; sa p&eacute;riode de retraite en conciliant d&eacute;couverte de nouveaux horizons et accompagnement
                        de personnes, enfants, adolescents, adultes, pr&ecirc;tes &agrave; d&eacute;passer leur limite.
                    </div>
                </div>
            </div>
        </div>

        <div id="cap-en-cap-03" class="tab-section" style="display: none;">
            <h2>Plus d'infos...</h2>
            <div style="display: grid; grid-template-columns: 100%;">
                <div>
                    <!-- Faire un don par <a href="https://www.helloasso.com/associations/passe-coque-l-association-des-passeurs-d-ecoute/collectes/cap-en-cap-a-bord-de-shadokt-residence-d-artiste-a-bord-de-shadok" target="HA">Hello Asso</a>.<br/>
                    <img src="./shadok/qrcode.png" style="width: 25vw;">
                    <br/-->
                    Contact : <a href="mailto:patbenoiton@gmail.com?subject=Projets%20De%20Cap%20en%20Cap">Patrick Benoiton</a>
                </div>
            </div>
            <div style="display: grid; grid-template-columns: 100%;">
                <div>
                    <!-- Faire un don par <a href="https://www.helloasso.com/associations/passe-coque-l-association-des-passeurs-d-ecoute/collectes/cap-en-cap-a-bord-de-shadokt-residence-d-artiste-a-bord-de-shadok" target="HA">Hello Asso</a>.<br/>
                    <img src="./shadok/qrcode.png" style="width: 25vw;">
                    <br/-->
                    Le blog <a href="https://decapencap.blogspot.com/" target="DCC">De Cap en Cap</a>
                </div>
            </div>
        </div>

        <div id="cap-en-cap-04" class="tab-section" style="display: none;">
            <h2>Nous soutenir financi&egrave;rement</h2>
            <div style="display: grid; grid-template-columns: 100%;">
                <div>
                    Faire un don par <a href="https://www.helloasso.com/associations/passe-coque-l-association-des-passeurs-d-ecoute/collectes/de-cap-en-cap" target="HA">Hello Asso</a>.<br/>
                    <img src="./cap.en.cap/qrcode-2.png" style="width: 25vw;">
                </div>
            </div>
            <div>
                <h3>De Cap en Cap</h3>
                De Cap en Cap est la rencontre de deux vieux r&ecirc;ves : le voyage en bateau, en c&ocirc;toyant des r&eacute;gions hors   des   sillages   habituels   de   croisi&egrave;res,
                et l'accompagnement de personnes rencontrant des diffcult&eacute;s de toutes sortes (d&eacute;socialisation, maladie, mal &ecirc;tre…) dans un univers souvent inconnu et
                extraordinaire mais &ocirc; combien accueillant.Le projet est h&eacute;berg&eacute; par une association, De Cap en Cap, en cours de constitution qui aura la charge de remettre le voilier,
                Nomadict, un Gin Fizz de 11,40m, en &eacute;tat de naviguer, puis d'organiser les s&eacute;jours en mer. La r&eacute;novation du navire se veut un exemple que l'on peut faire du neuf avec du vieux
                dans une optique sobre et mesur&eacute;e. <br/>
                Certes, Nomadict a 50 ans et ne pr&eacute;sente pas les caract&eacute;ristiques des car&egrave;nes volumineuses et rapides d'aujourd'hui. <br/>
                Mais, avec quelques modifications et r&eacute;fections, il permettra d'offrir un confort et une facilit&eacute; d'utilisation aux normes d'aujourd'hui.
                Il ne s'agit pas de tout remplacer par du neuf mais de r&eacute;cup&eacute;rer des mat&eacute;riaux abandonn&eacute;s voire jet&eacute;s, r&eacute;habiliter du mat&eacute;riel obsol&egrave;te, d'utiliser des mat&eacute;riaux
                biosourc&eacute;s et de d&eacute;velopper un syst&egrave;me de navigation "low tech" tout aussi performant que ce qui est propos&eacute; sur le march&eacute;.Ce fier navire permettra d'accueillir
                quatre  passagers  avec un  accompagnateur pour des s&eacute;jours th&eacute;rapeutiques &agrave; destination de personnes mal dans leur peau, pour des s&eacute;jours de recherche
                sur  l'influence de la navigation &agrave; voile sur les maladies inflammatoires et des sorties dans le cadre d'association comme
                Grand Largue (enfants en situation de protection administrative ou judiciaire), Matelot de la Vie (enfants hospitalis&eacute;s) et
                Gu&eacute;rir en mer (La voile comme th&eacute;rapie contre le burn out).

                <h3>Description des postes de d&eacute;penses</h3>
                Il s'agit de rendre Nomadict navigable dans les milieux exigeants et froids. Nous allons lui ajouter une
                jupe (plate-forme arri&egrave;re) pour un acc&egrave;s facilit&eacute; au mouillage et le stockage du radeau de survie, une  casquette rigide pour abriter le cockpit
                et l'acc&egrave;s &agrave; la cabine, offrant un poste de veille abrit&eacute; en  navigation, et un bout-dehors, afin d'accueillir des voiles de portant facilement
                man&oelig;uvrable en &eacute;quipage r&eacute;duit. L'accastillage ainsi que le plan des man&oelig;uvres va &ecirc;tre en grosse partie revus en r&eacute;cup&eacute;rant des &eacute;quipements "fin de s&eacute;rie" ou laisser
                de c&ocirc;t&eacute; par des &eacute;curies de course au large. L'int&eacute;rieur est en partie r&eacute;am&eacute;nager en ajoutant des rangements, en facilitant l'accueil et en offrant un environnement
                accueillant et confortable en restant simple.Nomadict est &agrave; Concarneau au chantier IDB Marine o&ugrave; les travaux seront effectu&eacute;s sous une tente r&eacute;alis&eacute;e avec du bois
                 et une bâche (neuve !) r&eacute;cup&eacute;r&eacute;s dans des chantiers navals.

                <h3>B&eacute;n&eacute;ficiaires finaux de la collecte</h3>
                Les sommes collect&eacute;es par Passe-Coque et De Cap en Cap seront int&eacute;gralement attribu&eacute;es aux travaux de remise en route jusqu'&agrave; la mise &agrave; l'eau.<br/>
                Tout donateur sera accueilli &agrave; bras ouverts pour un temps de navigation &agrave; bord de Nomadict suivant les disponibilit&eacute;s du bateau.

                <h3>Porteurs du projet</h3>
                Passe-Coque est le porteur principal du projet en tant qu'armateur du bateau. De Cap en Cap en assurera la gestion.

                <h3>Localisation du projet</h3>
                Concarneau - France

            </div>
        </div>
    </div>

</div>
