<div class="boat-card" header="De Cap en Cap">

    <div class="tab" style="margin-top: 30px; margin-bottom: 10px; display: grid; grid-template-columns: auto auto auto auto auto auto auto auto auto auto auto;"> <!-- TODO Improve the grid-template... -->
        <button class="tablinks tab-active" onclick="openTab(event, 'cap-en-cap-01');" title="Projet">Projet</button>
        <button class="tablinks" onclick="openTab(event, 'cap-en-cap-02');">D&eacute;tails</button>
        <button class="tablinks" onclick="openTab(event, 'cap-en-cap-03');">Contact</button>
        <button class="tablinks" onclick="openTab(event, 'cap-en-cap-04');">Nous soutenir</button>
    </div>

    <div class="pcc-dialog-tab-content">
        <div id="cap-en-cap-01" class="tab-section" style="display: block;">

            <!--div style="vertical-align: middle;"><img src="/images/construction.cone.png" height="26"> <b>Projets Low Tech&nbsp;!</b> <img src="/images/construction.cone.png" height="30"></div-->
            <div class="txt-img-div-2" style="margin-top: 0;">
                <!--iframe src="https://akirodic.com/p/jellyfish/" style="width: 80%; height: 100%;"></iframe-->
                <img src="/images/boats/nomadict/nomadict.00.jpg" style="width: 80%; margin: auto; margin-top: 5px;">
                <div style="padding: 14px;">
                    <div style="padding: 10px; line-height: 1.2em;">
                        "L'aventure repose sur la richesse des liens qu'elle &eacute;tablit, 
                        des probl&egrave;mes qu'elle pose, des cr&eacute;ations qu'elle provoque."<br/>
                        <i>Antoine de Saint Exup&eacute;ry</i>
                    </div>
                    <div style="padding: 10px; line-height: 1.2em;">
                        "Le bateau est en s&eacute;curit&eacute; dans le port. Mais, ce n'est pas pour cela que 
                        les bateaux ont &eacute;t&eacute; construits."<br/>
                        <i>Paulo Coelo</i>
                    </div>
                    <div style="padding: 10px; line-height: 1.2em;">
                        Franchir un cap, c'est mettre tout en &oelig;uvre pour acc&eacute;der &agrave; un inconnu synonyme de nouvel horizon. 
                        Il en est ainsi en bateau, &eacute;videmment, et dans la vie. Affronter et d&eacute;passer une probl&eacute;matique, 
                        quelle qu'elle soit, permet de grandir et de nous offrir de nouveaux horizons.
                    </div>
                </div>
            </div>
        </div>

        <div id="cap-en-cap-02" class="tab-section" style="display: none;">
            <h2>D&eacute;tails</h2>
            <div class="project-content" style="display: grid; grid-template-columns: 100%;">
                <div style="overflow: auto;">
                    <div>
                        De Cap en Cap est la rencontre de deux vieux r&ecirc;ves&nbsp;: le voyage en bateau, en c&ocirc;toyant des r&eacute;gions hors des 
                        sillages habituels de croisi&egrave;res, du cap Nord au cap Horn, qu'il est temps de r&eacute;aliser, et l'accompagnement de personnes, 
                        et particuli&egrave;rement des jeunes, rencontrant des difficult&eacute;s de toutes sortes (d&eacute;socialisation, maladie, mal &ecirc;tre…) 
                        dans un univers souvent inconnu et extraordinaire (sortant de l'ordinaire), offrant la possibilit&eacute; de d&eacute;couvrir une portion 
                        non v&eacute;cue d'eux-m&ecirc;mes.<br/>
                        La mer, le bateau, la navigation font peur. Ils attirent aussi. Ils impressionnent. Ils font cogiter. Ce contact avec l'infini, avec 
                        l'inconnu, avec "l'autre c&ocirc;t&eacute;", avec ce que l'on ne maîtrise pas, effraie et, de ce fait, fascine. Offrir la 
                        possibilit&eacute; de se d&eacute;couvrir le courage d'affronter l'inconnu me passionne autant qu'il peut lib&eacute;rer celui ou 
                        celle qui vit l'exp&eacute;rience. La force des &eacute;l&eacute;ments, le contact perp&eacute;tuel avec la nature, l'exiguït&eacute; 
                        du lieu de vie, la promiscuit&eacute; avec les autres &eacute;quipiers nous confronte avec notre &ecirc;tre profond. Les diff&eacute;rents 
                        masques de protection que l'on s'est forg&eacute; &agrave; terre pour s'adapter au milieu de vie et ses difficult&eacute;s, tombent rapidement &agrave; bord 
                        d'un voilier en navigation. La navigation permet de se retrouver soi.<br/>
                        Utiliser la mer &agrave; des fins th&eacute;rapeutiques remonte &agrave; l'Antiquit&eacute;. La navigation &agrave; cette fin est plus r&eacute;cente mais elle 
                        concerne autant les troubles somatiques que psychiques. Des personnalit&eacute;s comme Marcel Rufo, Boris Cyrulnik ou Xavier Pommereau 
                        ont utilis&eacute; ce m&eacute;dium pour am&eacute;liorer voire transformer nombre de leur patient. L'association Ocean Connect bas&eacute;e &agrave; 
                        Toulouse est en train d'initier en collaboration avec une &eacute;quipe du CHU de Rangueil, une &eacute;tude scientifique pilote sur la recherche clinique 
                        d'une hypoth&egrave;se de stabilisation voir gu&eacute;rison des maladies chroniques en mer.
                        Cette hypoth&egrave;se fait lien avec mes propres constatations lors de ma vie de marin-th&eacute;rapeute. Le fait de se sentir port&eacute; 
                        et la douceur des mouvements en voilier permet un rel&acirc;chement g&eacute;n&eacute;ral du corps et donc une baisse notable des ph&eacute;nom&egrave;nes 
                        inflammatoires. Les exemples de r&eacute;mission de maladie en navigation sont nombreux (je pense &agrave; Dominique Guyot souffrant de scl&eacute;rose en plaque dont les sympt&ocirc;mes ont pratiquement disparu lors de son p&eacute;riple en voilier ainsi qu'&agrave; Marie Dufay, une amie journaliste qui souffre de plusieurs pathologies nerveuses et musculaires pour qui la navigation &agrave; la voile calme les douleurs).
                        Nomadict accueillerait ainsi, dans le cadre d'Ocean Connect, des personnes souffrant de maladies d'origine inflammatoire suivant un 
                        protocole pr&eacute;cis afin d'observer les effets de la navigation sur l'&eacute;volution de la maladie. 
                        Parall&egrave;lement, il sera propos&eacute; des s&eacute;jours th&eacute;rapeutiques &agrave; destination de personnes mal dans leur peau 
                        afin de les accompagner dans la d&eacute;couverte de leurs fonctionnements, de ce qui les emp&ecirc;che &agrave; s'&eacute;panouir et surtout 
                        identifier et mobiliser des ressources insoupçonn&eacute;es. Ses s&eacute;jours seront r&eacute;alis&eacute;s en direct (nous sommes th&eacute;rapeutes) 
                        ou en collaboration avec des organismes d&eacute;di&eacute;s.
                    </div>
                    <div>
                        Enfin, Nomadict pourra participer &agrave; des op&eacute;rations organis&eacute;es par l'Association Grand Largue ou 
                        Matelots de la vie, qui chacun dans son domaine (jeune en situation de protection administrative ou judiciaire et enfants hospitalis&eacute;s)
                    </div>
                    <div>
                        <h3>&agrave; quoi servira l'argent collect&eacute;&nbsp;?</h3>
                        &agrave; la r&eacute;paration et pr&eacute;paration du bateau ainsi qu'&agrave; l'assistance logistique que 
                        Passe-Coque am&egrave;ne qu'il soit &eacute;cologique, social, humanitaire, ou patrimonial mais surtout maritime. 
                        Nomadict est un Gin Fizz construit en 1975. Il demande une r&eacute;fection importante. Nous envisageons, pour l'ext&eacute;rieur de lui 
                        ajouter une jupe &agrave; l'arri&egrave;re, un bout dehors pour porter un spi asym&eacute;trique et un gennaker, 
                        ainsi qu'une casquette rigide pour augmenter le confort dans les zones froides. &Agrave; l'int&eacute;rieur, le changement des vaigrages, 
                        quelques modifications d'emm&eacute;nagement, la r&eacute;fection du circuit &eacute;lectrique, le changement des appareils &eacute;lectroniques.
                        Il est pr&eacute;vu que quelques travaux de cette r&eacute;fection soient publi&eacute;s dans Voile Magazine.
                    </div>
                    <div>
                        <h3>Qui&nbsp;?</h3>
                        <b>Patrick Benoiton</b>, navigateur, journaliste, &eacute;crivain, th&eacute;rapeute, int&eacute;ress&eacute; du fonctionnement humain, 
                        veut donner un nouvel &eacute;lan dans sa vie avant que ce ne soit possible. Il r&ecirc;ve depuis longtemps de partager sa passion pour la vie en 
                        voilier et le d&eacute;passement du raisonnable &agrave; ceux qui n'y ont pas acc&egrave;s pour diverses raisons. Le "tout est possible" l'a 
                        souvent guid&eacute; dans ces choix. Il est temps de transmettre les quelques connaissances qu'il a pu accumuler.
                        <br/>
                        <b>Fr&eacute;d&eacute;rique Benoiton</b>, infirmi&egrave;re, cadre de sant&eacute;, coach, th&eacute;rapeute, montagnarde, curieuse de 
                        l'humain, veut apporter du sens &agrave; sa p&eacute;riode de retraite en conciliant d&eacute;couverte de nouveaux horizons et accompagnement 
                        de personnes, enfants, adolescents, adultes, pr&ecirc;tes &agrave; d&eacute;passer leur limite.
                    </div>
                </div>
            </div>
        </div>

        <div id="cap-en-cap-03" class="tab-section" style="display: none;">
            <h2>Plus d'infos...</h2>
            <div style="display: grid; grid-template-columns: 100%;">
                <div>
                    <!-- Faire un don par <a href="https://www.helloasso.com/associations/passe-coque-l-association-des-passeurs-d-ecoute/collectes/cap-en-cap-a-bord-de-shadokt-residence-d-artiste-a-bord-de-shadok" target="HA">Hello Asso</a>.<br/>
                    <img src="./shadok/qrcode.png" style="width: 25vw;">
                    <br/-->
                    Contact&nbsp;: <a href="mailto:patbenoiton@gmail.com?subject=Projets%20De%20Cap%20en%20Cap">Patrick Benoiton</a>
                </div>
            </div>
        </div>

        <div id="cap-en-cap-04" class="tab-section" style="display: none;">
            <h2>Nous soutenir financi&egrave;rement</h2>
            <div style="display: grid; grid-template-columns: 100%;">
                <div>
                    Faire un don par <a href="https://www.helloasso.com/associations/passe-coque-l-association-des-passeurs-d-ecoute/collectes/de-cap-en-cap" target="HA">Hello Asso</a>.<br/>
                    <img src="./cap.en.cap/qrcode-2.png" style="width: 25vw;">
                </div>
            </div>
            <div>
                <h3>De Cap en Cap</h3>
                "De Cap en Cap" is the merge of two old dreams: traveling by boat, passing through regions off the usual cruise lines, and supporting people experiencing all sorts of 
                difficulties (desocialization, illness, feeling unwell, etc.) in an often unknown and extraordinary but oh so welcoming world. 
                The project is hosted by an association, De Cap en Cap, currently being set up, which will be responsible for restoring the sailboat, Nomadict, an 11.40m Gin Fizz, 
                to sailing condition, and then organizing sea trips. The renovation of the ship is intended to be an example that you can make something new out of something old in a 
                sober and measured way.<br/>
                Of course, Nomadict is 50 years old and does not have the characteristics of today's large and fast hulls.<br/>
                But, with a few modifications and repairs, it will provide comfort and ease of use to today's standards. It is not a question of replacing everything with new but of recovering abandoned or even discarded materials, rehabilitating obsolete equipment, using bio-sourced materials and developing a "low tech" navigation system that is just as efficient as what is offered on the market. This proud ship will accommodate four passengers with a companion for therapeutic stays for people who are unhappy with their skin, for research stays on the influence of sailing on inflammatory diseases and outings as part of associations such as Grand Largue (children in administrative or judicial protection situations), Matelot de la Vie (hospitalized children) and Guérir en mer (Sailing as therapy against burnout).
                <h3>Description of of the expenses</h3>
                The question is to make Nomadict navigable in demanding and cold environments. We will add a scoop (rear platform) for easy access to the anchorage and storage of the life raft, 
                a rigid cap to shelter the cockpit and access to the cabin, offering a sheltered watch post while sailing, and a bowsprit, in order to accommodate 
                downwind sails that can be easily handled with a reduced crew. The deck fittings and the maneuvering plan will be largely revised by recovering "end of series" 
                equipment or equipment left aside by offshore racing teams. The interior is partly redeveloped by adding storage, facilitating reception and offering a welcoming and 
                comfortable environment while remaining simple. Nomadict is in Concarneau at the IDB Marine shipyard where the work will be carried out under a tent 
                made with wood and a tarpaulin (new!) recovered from shipyards. 
                <h3>Final beneficiaries of the collect</h3>
                The sums collected by Passe-Coque and De Cap en Cap will be entirely allocated to the work of restarting until the launch.
                Any donor will be welcomed with open arms for a sailing time on board Nomadict depending on the availability of the boat.
                <h3>Project leaders</h3>
                Passe-Coque is the main leader of the project as the owner of the boat. De Cap en Cap will manage it.
                <h3>Project location</h3>
                Concarneau - France
            </div>
        </div>
    </div>

</div>
