<div id="pcc-2" class="top-container-2"> <!-- This style is mandatory for the scrollTop to work -->
    <div class="home-width"> <!-- class="background" -->
        <!-- Content goes here -->
        <div style="width: 100%;">
            <div id="boat-club-01" style="display: block;">
                <div style="text-align: left; padding: 20px; background: rgba(255, 255, 255, 0.8); overflow: auto;">
                    <a name="01"><h2>Fonctionnement du boat&nbsp;club</h2></a>
                    <br/>
                    T&eacute;l&eacute;charger le <a href="./Brochure-Passe-Coque.pdf" target="PCC">document</a>.    
                    <div style="min-height: 300px; border-radius: 10px;/* background: silver;*/">
                        <h3>Les conditions d'adh&eacute;sion</h3>
                        <div>
                            <ul>
                                <li>L'adh&eacute;sion est obligatoire pour l'ensemble de l'&eacute;quipage et des passagers</li>
                                <li>Avoir 18 ans pour pouvoir &ecirc;tre chef de bord, 16 ans pour &ecirc;tre &eacute;quipier</li>
                                <li>&ecirc;tre adh&eacute;rent de l'association Passe Coque,</li>
                                <li>Accepter les conditions de la charte,</li>
                                <li>Soumettre son CV nautique,</li>
                                <li>Soumettre ses motivations &agrave; rejoindre le boat&nbsp;club.</li>
                            </ul>
                        </div>
                        <h3>L'adh&eacute;sion au boat&nbsp;club</h3>
                        <div>
                            <ul>
                                <li>Est automatique et gratuite pour les r&eacute;f&eacute;rents de bateaux de ce m&ecirc;me boat&nbsp;club</li>
                                <li>Prend en compte la place de port, l'assurance, l'entretien permanent, l'accompagnement &agrave; la prise en main, la pr&eacute;paration du bateau avant une sortie, l'&eacute;tat des lieux final,</li>
                                <li>Contrat annuel payable en 12 fois et renouvelable par tacite reconduction. Le tarif indiqu&eacute; comprend les frais de pr&eacute;l&egrave;vement et la garantie individuelle accident.</li>
                                <li>Donne la possibilit&eacute; de naviguer 20 jours dans l'ann&eacute;e, 6 jours cons&eacute;cutifs maximum, ces dur&eacute;es sont modifiables en fonction des plannings d'occupation des bateaux, </li>
                                <li>A une dur&eacute;e de 12 mois, depuis la date d'acceptation du paiement en ligne,</li>
                                <li>A un co&ucirc;t de 1 200 &euro; annuel pour le chef de bord, le r&egrave;glement est mensualis&eacute;,</li>
                                <li>Pour les &eacute;quipiers, deux cas : &eacute;quipier r&eacute;gulier (nombre de jours non limit&eacute; - tarif annuel de 300 &euro;) ou occasionnel (1 jour - tarif de 20 &euro;)</li>
                                <li>
                                    Peut-&ecirc;tre r&eacute;duite pour le chef de bord :
                                    <ul>
                                        <li>sur pr&eacute;sentation  d'une attestation ch&ocirc;mage</li>
                                        <li>sur pr&eacute;sentation  d'une carte d'&eacute;tudiant</li>
                                        <li>
                                            sur pr&eacute;sentation  volontaire de l'avis d'imp&ocirc;sition, pr&eacute;sentant le quotient familial :
                                            <ul>
                                                <li> ? &euro; /an => montant de l'adh&eacute;sion :   ? &euro;</li>
                                                <li> ? &euro; /an => montant de l'adh&eacute;sion :   ? &euro;
                                            </ul>
                                        </li>
                                    </ul>
                                </li>
                                <li>La demande d'adh&eacute;sion peut &ecirc;tre r&eacute;alis&eacute;e en ligne ou &ecirc;tre &eacute;dit&eacute;e, renseign&eacute;e et exp&eacute;di&eacute;e &agrave; l'association &agrave; l'adresse postale : 12bis Z.A. de Kerran, 56470 Saint‑Philibert</li>
                                <li>Pour toute demande d'information, contactez-nous par mail&nbsp;: pcc@passe-coque.com ou par t&eacute;l&eacute;phone au ?</li>
                            </ul>
                        </div>
                        <button onclick="clack_pcc('_4');" class="pc-button" style="margin: 5px;">Adh&eacute;rer au boat&nbsp;club</button>
                    </div>

                    <div style="text-align: center;">
                        <a name="02"><h2>Charte (droits et devoirs)</h2></a>
                        <h3>Boat&nbsp;Club solidaire et social Passe&#8209;Coque</h3>
                        <hr/>
                    </div>
                    T&eacute;l&eacute;charger la <a href="./Charte.Passe-Coque.Club.pdf" target="PCC">Charte</a>.
                    <hr/>
                    <div style="display: block; font-style: italic;">
                        <!--div style="text-align: center; border: 5px dotted navy; border-radius: 5px; padding: 10px; width: 50%; margin: auto;">
                            La charte est en cours d'&eacute;laboration avec les r&eacute;f&eacute;rents de chaque bateau mis &agrave; disposition du Club, 
                            leur liste n'&eacute;tant pas encore d&eacute;finitive....
                        </div-->
                        D&eacute;finitions&nbsp;:<br/>
                        <b>Adh&eacute;rent</b>&nbsp;: Personne inscrite au Boat-Club &agrave; jour de cotisation.<br/>
                        <b>R&eacute;f&eacute;rent</b>&nbsp;: Membre passe-coque responsable d'un bateau pr&eacute;sent dans la liste du Boat Club.<br/>
                        <b>Chef de Bord</b>&nbsp;: Responsable du bateau en navigation.<br/>
                        <b>&Eacute;quipier</b>&nbsp;: Personne inscrite en tant qu'&eacute;quipier au Boat Club.<br/>
                        La signature de la charte signifie que l'adh&eacute;rent accepte :
                        <ul>
                            <li>le projet du boat club Passe-Coque dans ses finalit&eacute;s, valeurs et mode de fonctionnement</li>
                            <li>ses propres devoirs &amp; responsabilit&eacute;s comme chef de bord lors de l'usage d'un bateau du Boat Club.</li>
                        </ul>
                    </div>

                    <h2>L'adh&eacute;rent participe &agrave; la vie du boat&nbsp;club associatif social et solidaire&nbsp;:</h2>
                    <p>
                        Le tarif d'adh&eacute;sion au boat&nbsp;club s'adapte aux ressources de l'adh&eacute;rent (sur pr&eacute;sentation 
                        volontaire de l'avis d'imposition, justification de ressources, attestation ch&ocirc;mage ou carte d'&eacute;tudiant),
                    </p>
                    <p>
                        L'adh&eacute;rent b&eacute;n&eacute;ficie de l'assurance de l'association lors de l'usage d'un bateau du club. 
                    </p>          
                    <p>
                        L'adh&eacute;rent s'engage &agrave;&nbsp;: 
                        <ul>
                            <li>respecter le mat&eacute;riel, rendre le bateau dans le m&ecirc;me &eacute;tat que lors sa prise en main, propre et rang&eacute;.</li>
                            <li>apporter son avitaillement, son linge, ses consommables, ses produits d'entretien</li>
                            <li>remettre &agrave; niveau les consommables (eau &amp; carburant) apr&egrave;s la navigation,</li> 
                            <li>respecter le r&eacute;f&eacute;rent qui investit son temps toute l'ann&eacute;e pour permettre des navigations dans les meilleures conditions.</li>
                            <li>participer aux activit&eacute;s collectives en partageant ses connaissances et son temps disponible avec
                                d'autres membres du club pour apprendre ou faire apprendre, contribuer &agrave; la convivialit&eacute;, cr&eacute;er
                                du lien pour rendre la navigation la plus accessible possible &agrave; tous. </li>
                        </ul>
                    </p>        
                        
                    <h2>En bon marin, l'adh&eacute;rent respecte les imp&eacute;ratifs de s&eacute;curit&eacute; :</h2>
                    <p>
                        Le chef de bord&nbsp;:
                        <ul>
                            <li>&eacute;tablit le programme de navigation en fonction des conditions de mer (m&eacute;t&eacute;o, courants, mar&eacute;es), de l'&eacute;quipage et des capacit&eacute;s du voilier arm&eacute;.</li>
                            <li>respecte et fait respecter les r&egrave;gles de s&eacute;curit&eacute; &agrave; bord afin d'assurer l'int&eacute;grit&eacute; des membres de l'&eacute;quipage, des usagers de la mer et du mat&eacute;riel. Le port du gilet de sauvetage est obligatoire.</li>
                            <li>est responsable de la conduite du bateau dans le respect des r&egrave;gles de barre et de route (Balisage, feux des navires, RIPAM, marques de jour et de nuit, signaux sonores par visibilit&eacute; r&eacute;duite, signaux de man&oelig;uvre...)</li>
                            <li>est le seul maître &agrave; bord même en pr&eacute;sence du r&eacute;f&eacute;rent (sauf exceptions pr&eacute;cis&eacute;es au cas par cas sur la r&eacute;servation),</li>
                            <li>encadre l'&eacute;quipage, r&eacute;partit les r&ocirc;les et responsabilit&eacute;s, communique de mani&egrave;re claire et efficace, s'assure qu'il est compris,</li>
                            <li>motive et encourage l'&eacute;quipage dans un bon esprit de coh&eacute;sion &agrave; bord.</li>
                            <li>assure la surveillance de l'&eacute;quipage, du bateau, de ses &eacute;quipements, de son environnement et doit effectuer des v&eacute;rifications r&eacute;guli&egrave;res,</li>
                            <li>g&egrave;re les situations d'urgence.</li>
                            <li>S'assure que tous ses &eacute;quipiers sont &agrave; jour des cotisations li&eacute;es &agrave; l'embarquement.</li>
                        </ul>
                    </p>         
                    
                    <h2>L'adh&eacute;rent respecte les principes d'Eco&#8209;navigation&nbsp;:</h2>
                    <p>
                        L'adh&eacute;rent s'engage &agrave;&nbsp;: 
                        <ul>
                            <li>prendre soin des bateaux lors de leur usage, contribuant ainsi &agrave; allonger leur dur&eacute;e de vie,</li>
                            <li>utiliser les WC marins loin des lieux de baignade,</li>
                            <li>utiliser les &eacute;quipements portuaires (douches, lavabos, &eacute;viers, WC),</li>
                            <li>utiliser des produits &eacute;cologiques en petite quantit&eacute; et d'origine v&eacute;g&eacute;tale pour la vie &agrave; bord,</li>
                            <li>limiter les emballages et d&eacute;chets autant que possible, trier les d&eacute;chets, ne jeter aucun d&eacute;chet par-dessus bord,</li>
                            <li>&eacute;conomiser l'utilisation de l'eau &agrave; bord, y compris en ne rinçant pas la coque &agrave; l'eau douce,</li>
                            <li>privil&eacute;gier l'utilisation de la godille au moteur pour les petites unit&eacute;s de navigation, dans le cas de man&oelig;uvres de port et au mouillage,</li>
                            <li>choisir un fond sablonneux pour mouiller l'ancre du bateau afin de prot&eacute;ger les zost&egrave;res.</li>
                            <li>observer les animaux sans les nourrir ni les d&eacute;ranger.</li>
                        </ul>
                    </p>
                    <div style="margin-top: -12px; text-align: center; padding: 40px 60px; background: white;">
                        <!--hr/-->
                        <div style="margin: 10px; padding: 10px; border: 1px solid navy; border-radius: 10px; font-weight: bold;" title="Warning&nbsp;!">
                            Le non-respect des r&egrave;gles et valeurs du club peut entrainer une exclusion. 
                        </div>
                    </div>

                    <hr/>
                    <!-- Bottom -->
                    <div style="display: grid; grid-template-columns: 50% 50%;">
                        <div style="vertical-align: top; margin: 0 10px; padding: 5px; line-height: 1.1em;">
                            <h2 style="margin-bottom: 0;">Passe&#8209;Coque Boat Club</h2>
                            12<sup><small style="font-size: 0.75em;">bis</small></sup> Z.A. de Kerran
                            <br/>
                            56470 Saint&#8209;Philibert
                            <br/>
                            <a href="mailto:pcc@passe-coque.com">pcc@passe-coque.com</a>
                            <br/>
                        </div>
                        <div style="vertical-align: top; margin: 0 10px; padding: 5px; line-height: 1.1em;">
                            <h2 style="margin-bottom: 0;">Association Passe&#8209;Coque</h2>
                            12<sup><small style="font-size: 0.75em;">bis</small></sup> Z.A. de Kerran
                            <br/>
                            56470 Saint&#8209;Philibert
                            <br/>
                            <a href="mailto:contact@passe-coque.com">contact@passe-coque.com</a>
                            <br/>
                        </div>
                    </div>
                </div>
            </div>
        
        </div>

        <!-- To keep seing the content above the copyright -->
        <div id="bottom-filler" style="height: 18px;"></div>
    </div>
</div>
