<div id="pcc-2" class="top-container-2" style="height: 1024px; overflow-y: scroll;"> <!-- This style is mandatory for the scrollTop to work -->
    <div class="home-width"> <!-- class="background" -->
        <!-- Content goes here -->
        <div style="width: 100%;">
            <div id="boat-club-01" style="display: block;">
                <div style="text-align: left; padding: 20px; background: rgba(255, 255, 255, 0.8); overflow: scroll;">
                    <a name="01"><h2>Fonctionnement du boat&nbsp;club</h2></a>
                    <div style="min-height: 300px; border-radius: 10px;/* background: silver;*/">
                        <h3>Les conditions d'adh&eacute;sion</h3>
                        <div>
                            <ul>
                                <li>L'adh&eacute;sion est obligatoire pour l'ensemble de l'&eacute;quipage et des passagers</li>
                                <li>Avoir 18 ans pour pouvoir &ecirc;tre chef de bord, 16 ans pour &ecirc;tre &eacute;quipier</li>
                                <li>&ecirc;tre adh&eacute;rent de l'association Passe Coque,</li>
                                <li>Accepter les conditions de la charte,</li>
                                <li>Soumettre son CV nautique,</li>
                                <li>Soumettre ses motivations &agrave; rejoindre le boat&nbsp;club.</li>
                            </ul>
                        </div>
                        <h3>L'adh&eacute;sion au boat&nbsp;club</h3>
                        <div>
                            <ul>
                                <li>Est automatique et gratuite pour les r&eacute;f&eacute;rents de bateaux de ce m&ecirc;me boat&nbsp;club</li>
                                <li>Prend en compte la place de port, l'assurance, l'entretien permanent, l'accompagnement &agrave; la prise en main, la pr&eacute;paration du bateau avant une sortie, l'&eacute;tat des lieux final,</li>
                                <li>Contrat annuel payable en 12 fois et renouvelable par tacite reconduction. Le tarif indiqu&eacute; comprend les frais de pr&eacute;l&egrave;vement et la garantie individuelle accident.</li>
                                <li>Donne la possibilit&eacute; de naviguer 20 jours dans l'ann&eacute;e, 6 jours cons&eacute;cutifs maximum, ces dur&eacute;es sont modifiables en fonction des plannings d'occupation des bateaux, </li>
                                <li>A une dur&eacute;e de 12 mois, depuis la date d'acceptation du paiement en ligne,</li>
                                <li>A un co&ucirc;t de 1 200 &euro; annuel pour le chef de bord, le r&egrave;glement est mensualis&eacute;,</li>
                                <li>Pour les &eacute;quipiers, deux cas : &eacute;quipier r&eacute;gulier (nombre de jours non limit&eacute; - tarif annuel de 300 &euro;) ou occasionnel (1 jour - tarif de 20 &euro;)</li>
                                <li>
                                    Peut-&ecirc;tre r&eacute;duite pour le chef de bord :
                                    <ul>
                                        <li>sur pr&eacute;sentation  d'une attestation ch&ocirc;mage</li>
                                        <li>sur pr&eacute;sentation  d'une carte d'&eacute;tudiant</li>
                                        <li>
                                            sur pr&eacute;sentation  volontaire de la feuille d'imp&ocirc;ts pr&eacute;sentant le quotient familial :
                                            <ul>
                                                <li> ? &euro; /an => montant de l'adh&eacute;sion :   ? &euro;</li>
                                                <li> ? &euro; /an => montant de l'adh&eacute;sion :   ? &euro;
                                            </ul>
                                        </li>
                                    </ul>
                                </li>
                                <li>La demande d'adh&eacute;sion peut &ecirc;tre r&eacute;alis&eacute;e en ligne ou &ecirc;tre &eacute;dit&eacute;e, renseign&eacute;e et exp&eacute;di&eacute;e &agrave; l'association &agrave; l'adresse postale : 12bis Z.A. de Kerran, 56470 Saint‑Philibert</li>
                                <li>Pour toute demande d'information, contactez-nous par mail&nbsp;: contact@passeurdecoute.fr ou par t&eacute;l&eacute;phone au ?</li>
                            </ul>
                        </div>
                        <button onclick="clack_pcc('_42');" class="pc-button" style="margin: 5px;">Adh&eacute;rer au boat&nbsp;club</button>
                    </div>

                    <a name="02"><h2>La charte du Passe&#8209;Coque boat&nbsp;club</h2></a>
                    <div style="display: grid; grid-template-columns: auto; width: 100%;">
                        <div style="text-align: center; border: 5px dotted navy; border-radius: 5px; padding: 10px; width: 50%; margin: auto;">
                            La charte est en cours d'&eacute;laboration avec les r&eacute;f&eacute;rents de chaque bateau mis &agrave; disposition du Club, 
                            leur liste n'&eacute;tant pas encore d&eacute;finitive....
                        </div>
                    </div>

                    <h2>L'adh&eacute;rent participe &agrave; la vie du boat&nbsp;club associatif social et solidaire&nbsp;:</h2>
                    <p>
                        Le tarif d'adh&eacute;sion au boat&nbsp;club&nbsp;: 
                        <ul>
                            <li>s'adapte aux ressources de l'adh&eacute;rent (sur pr&eacute;sentation volontaire de la feuille d'imp&ocirc;t),</li>
                            <li>pourra &ecirc;tre adapt&eacute; en fonction du temps consacr&eacute; par l'adh&eacute;rent &agrave; la vie de l'association et du boat&nbsp;club (minimum 2 jours de chantiers participatifs dans l'ann&eacute;e).</li>
                        </ul>
                    </p>
                    <p>
                        L'adh&eacute;rent b&eacute;n&eacute;ficie de l'assurance de l'association lors de l'usage d'un bateau du club. 
                    </p>          
                    <p>
                        L'adh&eacute;rent s'engage &agrave;&nbsp;: 
                        <ul>
                            <li>respecter le mat&eacute;riel, rendre le bateau dans le m&ecirc;me &eacute;tat technique qu'&agrave; sa prise en main, propre et rang&eacute;.</li>
                            <li>apporter son avitaillement, son linge, ses consommables, ses produits d'entretien</li>
                            <li>remettre &agrave; niveau les consommables (eau & carburant) apr&egrave;s la navigation,</li> 
                            <li>respecter le r&eacute;f&eacute;rent qui investit son temps toute l'ann&eacute;e pour permettre des navigations dans les meilleures conditions.</li>
                            <li>participer aux activit&eacute;s collectives, &agrave; faire b&eacute;n&eacute;ficier le club de ses connaissances, partager du temps avec des 
                                membres du club pour apprendre ou faire apprendre, contribuer &agrave; la convivialit&eacute;, cr&eacute;er du lien, et ainsi rendre la navigation accessible &agrave; tous.</li>
                        </ul>
                    </p>        
                        
                    <h2>En bon marin, l'adh&eacute;rent respecte les imp&eacute;ratifs de s&eacute;curit&eacute; :</h2>
                    <p>
                        L'adh&eacute;rent s'engage &agrave;&nbsp;: 
                        <ul>
                            <li>communiquer son exp&eacute;rience en toute transparence au r&eacute;f&eacute;rent lors de la r&eacute;servation,</li>
                            <li>&eacute;tablir le programme de navigation en fonction des conditions de mer, de l'&eacute;quipage et des capacit&eacute;s du voilier arm&eacute;. 
                                Il est le seul ma&icirc;tre &agrave; bord et chef de bord m&ecirc;me en pr&eacute;sence du r&eacute;f&eacute;rent (les exceptions seront pr&eacute;cis&eacute;es au cas par cas sur la r&eacute;servation),</li>
                            <li>respecter et faire respecter les r&egrave;gles de s&eacute;curit&eacute; &agrave; bord pour la s&eacute;curit&eacute; des membres de l'&eacute;quipage, des usagers de la mer et du mat&eacute;riel. 
                                Le port du gilet de sauvetage est obligatoire.</li>
                        </ul>
                    </p>         
                    
                    <h2>L'adh&eacute;rent respecte les principes d'Eco&#8209;navigation&nbsp;:</h2>
                    <p>
                        L'adh&eacute;rent s'engage &agrave;&nbsp;: 
                        <ul>
                            <li>prendre soin des bateaux lors de leur usage, contribuant ainsi &agrave; allonger leur dur&eacute;e de vie,</li>
                            <li>utiliser les WC marins loin des lieux de baignade,</li>
                            <li>utiliser les &eacute;quipements portuaires (douches, lavabos, &eacute;viers, WC),</li>
                            <li>utiliser des produits &eacute;cologiques en petite quantit&eacute; et d'origine v&eacute;g&eacute;tale pour la vie &agrave; bord,</li>
                            <li>limiter les emballages et d&eacute;chets autant que possible, trier les d&eacute;chets, ne jeter aucun d&eacute;chet par-dessus bord,</li>
                            <li>&eacute;conomiser l'utilisation de l'eau &agrave; bord, y compris en ne rinçant pas la coque &agrave; l'eau douce,</li>
                            <li>privil&eacute;gier l'utilisation de la godille au moteur pour les petites unit&eacute;s de navigation, dans le cas de man&oelig;uvres de port et au mouillage,</li>
                            <li>choisir un fond sablonneux pour mouiller l'ancre du bateau afin de prot&eacute;ger les zost&egrave;res.</li>
                            <li>observer les animaux sans les nourrir ni les d&eacute;ranger.</li>
                        </ul>
                    </p>

                    <hr/>
                    <!-- Bottom -->
                    <div style="vertical-align: top; margin: 0 10px; padding: 5px; line-height: 1.1em;">
                        <h2 style="margin-bottom: 0;">Association Passe&#8209;Coque</h2>
                        12<sup><small style="font-size: 0.75em;">bis</small></sup> Z.A. de Kerran
                        <br/>
                        56470 Saint&#8209;Philibert
                        <br/>
                        <a href="mailto:contact@passeurdecoute.fr">contact[at]passeurdecoute.fr</a>
                        <br/>
                        <!-- Tel: +33 02 XX XX XX XX -->
                    </div>
                </div>
            </div>
        
        </div>

        <!-- To keep seing the content above the copyright -->
        <div id="bottom-filler" style="height: 18px;"></div>
    </div>
</div>
