<!DOCTYPE html>
<html lang="fr">
<head>
	<meta charset="UTF-8">
	<title>Passe&#8209;Coque - LowTech</title>
	<meta name="viewport" content="width=device-width, initial-scale=1.0">

	<!--link rel="icon" type="image/png" href="./infinity.png"-->
	<link rel="icon" type="image/png" href="../logos/LOGO_PC_no_txt.png">
	<!--link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/-->
	<link rel="stylesheet" href="../fonts/font.01.css">
	<link rel="stylesheet" href="../fonts/font.02.css">

	<link rel="stylesheet" href="../passe-coque.css" type="text/css"/>
	<link rel="stylesheet" href="./low-tech.css" type="text/css"/>
	<style type="text/css">
		/* Empty */
    </style>
</head>
	
<body>

<h1 id="navigation-low-tech">Navigation Low Tech</h1>
<p><a href="./low.tech.html">En anglais</a></p>

<h2 id="pr-eacute-ambule">Pr&eacute;ambule</h2>
<p>Le monde a &eacute;t&eacute; d&eacute;couvert en bateau. Et &agrave; l&#39;&eacute;poque, l&#39;&eacute;lectricit&eacute; n&#39;&eacute;tait en g&eacute;n&eacute;ral - voire uniquement - disponible que pendant les orages.<br>Les navigateurs (comme Colomb, Cook, et les autres) utilisaient des techniques de navigation <strong>no-tech</strong>.<br>Ces techniques fonctionnent toujours aujourd&#39;hui, et m&eacute;riteraient s&ucirc;rement de ne pas &ecirc;tre oubli&eacute;es. Mais cette section illustre autre chose, il s&#39;agit ici d&#39;utiliser des technologies modernes, &agrave; partir de petits instruments bon march&eacute;.<br>Il est n&eacute;cessaire de ma&icirc;triser ces technologies pour les mettre en &oelig;uvre.<br>C&#39;est bien l&agrave; toute la diff&eacute;rence entre un outil et une bo&icirc;te noire. La bo&icirc;te noire d&eacute;cide toute seule, et quand elle d&eacute;cide de se mettre en botte, vous l&#39;avez dans l&#39;os. L&#39;outil fait ce qu&#39;on lui dit de faire. Si &ccedil;a ne marche pas, c&#39;est probablement parce qu&#39;on s&#39;en sert mal. Et on doit pouvoir arranger &ccedil;a.</p>
<p>Pour la navigation, on a besoin de :</p>
<ul>
	<li>conna&icirc;tre notre position</li>
	<li>et &eacute;ventuellement de la porter sur une carte</li>
	<li>savoir o&ugrave; on va</li>
	<li>savoir comment est le vent</li>
	<li>savoir ce que font les autres bateaux</li>
	<li>etc...</li>
</ul>
<p>Pour la position, des techniques comme le GPS peuvent &ecirc;tre une solution.<br>Des compas &eacute;lectroniques existent, &ccedil;a peut nous dire o&ugrave; on va.<br>Pour la vitesse du bateau, la vitesse et la direction du vent, il existe des &eacute;quipements &eacute;lectroniques.<br>Les donn&eacute;es &eacute;mises par ces instruments sont en g&eacute;n&eacute;ral en conformit&eacute; avec un des plus vieux standards informatiques, appel&eacute; NMEA (National Marine Electronics Association).</p>
<p>C&#39;est cette technologie qui est utilis&eacute;e dans les Trackers et Chart Plotters du march&eacute; ; mais voyons si on peut envisager d&#39;autres solutions.</p>
<h2 id="possibilit-eacute-s">Possibilit&eacute;s</h2>
<p>Pour rassembler et utiliser les donn&eacute;es &eacute;mises par les &eacute;quipements &eacute;lectroniques, on va avoir besoin d&#39;une sorte d&#39;ordinateur, et de comp&eacute;tences en programmation.</p>
<h3 id="ordinateurs">Ordinateurs</h3>
<p>Dans ce domaine, le vainqueur &eacute;vident pourrait &ecirc;tre le Raspberry Pi.<br>C&#39;est un petit ordinateur single-board, construit et con&ccedil;u en Angleterre, par Eben Upton ; il fonctionne sous Linux, et il est plus puissant que l&#39;ordinateur que j&#39;avais sur mon bureau il y a 40 ans... En plus, sa consommation en &eacute;nergie est ridicule. Il en existe plusieurs mod&egrave;les, le plus petit convient (Raspberry Pi Zero W - <code>W</code> c&#39;est pour wireless), &ccedil;a co&ucirc;te moins de 20 Euros.  </p>
<ul>
	<li>Le site web Raspberry Pi <a href="https://www.raspberrypi.com/">https://www.raspberrypi.com/</a></li>
	<li>Alternatives au Raspberry Pi : <a href="https://pallavaggarwal.in/raspberry-pi-alternatives-clones/">https://pallavaggarwal.in/raspberry-pi-alternatives-clones/</a></li>
</ul>
<h3 id="programmation">Programmation</h3>
<p>On peut utiliser plusieurs langages de programmation. C, Java, Python, ... Encore une fois, comme le Raspberry Pi tourne sous Linux, tous les langages qui y sont impl&eacute;ment&eacute;s peuvent faire l&#39;affaire.<br>La communication entre composant &eacute;crits dans les langages diff&eacute;rents peut poser un probl&egrave;me..., r&eacute;solu en utilisant des protocoles comme TCP.<br>Beaucoup de fournisseurs de composants (comme BMP180, BME180, etc) donnent aussi des exemples de code &eacute;crits Python.</p>
<p>On utilisera principalement Java et Python. Mais &ccedil;a n&#39;emp&ecirc;che pas d&#39;autres langages de rejoindre la sc&egrave;ne.</p>
<h2 id="plusieurs-projets">Plusieurs Projets</h2>
<ul>
	<li>
		<a href="./nav.server/nav.server_fr.html">Minimal Nav Server</a>
		<ul>
			<li>Avec un GPS, et un &eacute;cran eInk.</li>
		</ul>
	</li>
	<li><a href="chartless.maps_fr.html">Chartless Maps</a></li>
	<li>. . .</li>
</ul>
<p>
	<h3>Documents</h3>
	Pour la navigation low-tech - astronomique et autres - on a parfois besoin de documents.
	En voici, publi&eacute;s par Passe-Coque :
	<ul>
		<li><a href="documents/almanac.2024.pdf" target="doc">&Eacute;ph&eacute;merides nautiques, pour 2024</a></li>
		<li><a href="documents/lunar.2024.pdf" target="doc">Distances lunaires, pour 2024</a></li>
		<li><a href="documents/perpetual.2024.2030.pdf" target="doc">Almanac "perp&eacute;tuel", 2024-2030</a></li>
		<li><a href="documents/port-tudy.2024.pdf" target="doc">Mar&eacute;es &agrave; Port-Tudy, pour 2024</a></li>
		<li><a href="documents/nse.pdf" target="doc">Naviguer sans &eacute;lectricit&eacute;</a></li>
		<li><a href="documents/100.all.tables.A4.pdf" target="doc">Tables de Navigation</a></li>
	</ul>
</p>

</body>
</html>
